# ForwardIterator Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ElectricalSystemSet..::..ForwardIterator Method
ElectricalSystemSet Class See Also
---
Retrieve a forward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public virtual ElectricalSystemSetIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As ElectricalSystemSetIterator
```

Visual C++
---
```text
public:
virtual ElectricalSystemSetIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the set.
# See Also
ElectricalSystemSet Class
Autodesk.Revit.DB.Electrical Namespace